step-by-step/030-populate-database/020-soap/0300-экземпляры-модулей/0100.xml

<?xml version="1.0" ?>
<!-- Создаем экземпляр модуля -->
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <auth xmlns="http://ws.base.kernel.bgbilling.bitel.ru/" pswd="admin" user="admin"></auth>
    </S:Header>
    <S:Body>
        <ns5:moduleAdd xmlns:common="http://common.bitel.ru"
                       xmlns:ns5="http://service.common.module.kernel.bgbilling.bitel.ru/"
                       xmlns:xs="http://www.w3.org/2001/XMLSchema"
                       xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <module xmlns="">inet</module>
            <title xmlns="">Интернет</title>
        </ns5:moduleAdd>
    </S:Body>
</S:Envelope>
